from django import forms


class ChannelParseForm(forms.Form):
    channel_identifier = forms.CharField(
        label="ID канала username или ссылка",
        max_length=255,
        required=True,
        widget=forms.TextInput(
            attrs={
                "placeholder": "Введите ID канала username или ссылку на канал",
                "class": "form-control",
            }
        ),
    )

    category = forms.ChoiceField(
        required=True,
        choices=[
            ("Выберите категорию...", "Выберите категорию..."),
            ("Все категории", "Все категории"),
            ("Новости и СМИ", "Новости и СМИ"),
            ("Юмор и развлечения", "Юмор и развлечения"),
            ("Технологии", "Технологии"),
            ("Экономика", "Экономика"),
            ("Бизнес и стартапы", "Бизнес и стартапы"),
            ("Криптовалюты", "Криптовалюты"),
            ("Путешествия", "Путешествия"),
            ("Маркетинг, PR, реклама", "Маркетинг, PR, реклама"),
            ("Психология", "Психология"),
            ("Дизайн", "Дизайн"),
            ("Политика", "Политика"),
            ("Искусство", "Искусство"),
            ("Право", "Право"),
            ("Образование", "Образование"),
            ("Книги", "Книги"),
            ("Лингвистика", "Лингвистика"),
            ("Карьера", "Карьера"),
            ("Познавательное", "Познавательное"),
            ("Курсы и гайды", "Курсы и гайды"),
            ("Авто", "Авто"),
            ("Спорт", "Спорт"),
            ("Мода и красота", "Мода и красота"),
            ("Здоровье и Фитнес", "Здоровье и Фитнес"),
            ("Медицина", "Медицина"),
            ("Картинки и фото", "Картинки и фото"),
            ("Софт и приложения", "Софт и приложения"),
            ("Видео и фильмы", "Видео и фильмы"),
            ("Музыка", "Музыка"),
            ("Игры", "Игры"),
            ("Еда и кулинария", "Еда и кулинария"),
            ("Цитаты", "Цитаты"),
            ("Рукоделие", "Рукоделие"),
            ("Семья и дети", "Семья и дети"),
            ("Природа", "Природа"),
            ("Интерьер и строительство", "Интерьер и строительство"),
            ("Telegram", "Telegram"),
            ("Инстаграм", "Инстаграм"),
            ("Продажи", "Продажи"),
            ("Транспорт", "Транспорт"),
            ("Религия", "Религия"),
            ("Эзотерика", "Эзотерика"),
            ("Даркнет", "Даркнет"),
            ("Букмекерство", "Букмекерство"),
            ("Шок-контент", "Шок-контент"),
            ("Эротика", "Эротика"),
            ("Для взрослых", "Для взрослых"),
            ("Другое", "Другое"),
        ],
        label="Категория канала",
        widget=forms.Select(
            attrs={
                "class": "form-control form-select",
            }
        ),
    )

    country = forms.CharField(
        required=True,
        label="Страна",
        widget=forms.TextInput(attrs={"class": "form-control"}),
    )

    language = forms.CharField(
        required=True,
        label="Язык контента канала",
        widget=forms.TextInput(attrs={"class": "form-control"}),
    )

    limit = forms.IntegerField(
        label="Количество постов",
        min_value=1,
        max_value=20,
        initial=10,
        widget=forms.NumberInput(attrs={"class": "form-control"}),
    )
